/*
#include<iostream>
using namespace std;
int main()
{
	//所谓数组就是一个集合，里面存放了相同类型的数据元素
	//特点：1.数组中的每个数据元素都是相同的数据类型
	//		2.数组是由连续的内存位置组成的
	//定义方式：1.数据类型 数组名[ 数组长度 ];
	//			2.数据类型 数组名[ 数组长度 ] = { 值1 , 值2... }
	//			3.数据类型 数组名[ ] = { 值1 , 值2... }

	int arr[5];
	arr[0] = 10;		//数组元素的下标从0开始
	arr[1] = 20;
	arr[2] = 30;
	arr[3] = 40;
	arr[4] = 50;

	cout << arr[0] << endl;

	///////////////////////////////////////////////////////////////////////////////////////
	
	int arr1[5] = { 10,20,30,40,50 };		//如果在初始化数据时，没有全部填完，会用0填补

	cout << arr1[1] << endl;

	for (int i=0 ; i < 5; i++ )		//利用循环来输出数组中的值
	{
		cout << arr1[i] << endl;
	}		

	///////////////////////////////////////////////////////////////////////////////////////

	int arr3[] = { 10,20,30,40,50,60,70,80,90 };		//定义数组的时候必须有初始长度
	for (int j = 0; j < 9; j++)
	{
		cout << arr3[j] << endl;
	}

	system("pause");

	return 0;
}
*/