/*
#include<iostream>
using namespace std;

int main()
{
	//const修饰指针---常量指针
	//const修饰常量---指针常量
	//const既修饰指针，又修饰常量

	
	int a = 10;
	int b = 10;
	int* p = &a;
	
//////////////////////////////////////////////////////////////////////////////////////////1.常量指针
	const int* p = &a;			//特点：指针的指向可以修改，但是指针指向的值不可以改
	
	//*p = 20;					//false,指针指向的值不可以修改
	   p = &b;					//true, 指针的指向可以修改

//////////////////////////////////////////////////////////////////////////////////////////2.指针常量
	int* const p = &a;			//特点：指针的指向不可以修改,但是指针指向的值可以修改

	  *p = 20;					//true, 指针指向的值可以修改
	//p = &b;					//false,指针的指向不可以修改

//////////////////////////////////////////////////////////////////////////////////////////3.既修饰指针，又修饰常量
	const int* const p = &a;	//特点：指针的指向和指针指向的值都不可以修改

	//*p = 20;					//false,指针的指向不可以修改
	//p = &b;					//false,指针指向的值不可以修改

	system("pause");			

	return 0;
}
*/